
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = Не ПроверитьЗаполнение();
	
	// регистр РасходыПоМероприятиям 
	Движения.РасходыПоМероприятиям.Записывать = Истина;
	Для Каждого ТекСтрокаСоставРасходов Из СоставРасходов Цикл
		Движение = Движения.РасходыПоМероприятиям.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Мероприятие = Мероприятие;
		Движение.Поставщик = Поставщик;
		Движение.СтатьяРасходов = ТекСтрокаСоставРасходов.СтатьяРасходов;
		Движение.Сумма = ТекСтрокаСоставРасходов.Сумма;
	КонецЦикла;

КонецПроцедуры